code-review/NRB_3471_3546/База_Было/Documents/ЗаявлениеНаУчастиеВОферте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаУчастиеВОферте</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерСЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаОферты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КарточкаОферты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦБ</Name>
					<Comment>Количество ценных бумаг, предъявляемых к оферте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПриемеКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияВКабинетеКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЗаявлениеНаУчастиеВОферте/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЯвляетсяДепонентом = Справочники.Контрагенты.ЯвляетсяДепонентом(Объект.Клиент);
	УстановитьВидимостьИДоступностьЭлементов(ТекущийОбъект);
	ПоказатьВремяОтправкиИТекущийСтатусДоставки(ТекущийОбъект.Ссылка);
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьИДоступностьЭлементов(Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВидимостьИДоступностьЭлементов(ТекущийОбъект);
	Если ТекущийОбъект.УведомитьОПриемеКлиента Тогда
		ПоказатьВремяОтправкиИТекущийСтатусДоставки(ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УведомитьОПриемеКлиентаПриИзменении(Элемент)
	Элементы.УведомитьОПриемеКлиента.ТолькоПросмотр = Объект.УведомитьОПриемеКлиента;
КонецПроцедуры

&НаКлиенте
Процедура КарточкаОфертыПриИзменении(Элемент)
	КарточкаОфертыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	ЯвляетсяДепонентом = Справочники.Контрагенты.ЯвляетсяДепонентом(Объект.Клиент);
КонецПроцедуры

&НаСервере
Процедура КарточкаОфертыПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КарточкаОферты) Тогда
		Объект.ЦеннаяБумага = Объект.КарточкаОферты.ЦеннаяБумага;
		Объект.ДатаОферты = Объект.КарточкаОферты.ДатаОферты;
	КонецЕсли;
	УстановитьВидимостьИДоступностьЭлементов(Объект);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов(ОбъектДанных)
	НельзяМенятьКлючевыеПоля = ЗначениеЗаполнено(ОбъектДанных.КарточкаОферты);
	Элементы.ЦеннаяБумага.ТолькоПросмотр = НельзяМенятьКлючевыеПоля;
	Элементы.ДатаОферты.ТолькоПросмотр = НельзяМенятьКлючевыеПоля;
	Элементы.УведомитьОПриемеКлиента.ТолькоПросмотр = ОбъектДанных.УведомитьОПриемеКлиента;
КонецПроцедуры

&НаСервере
Процедура ПоказатьВремяОтправкиИТекущийСтатусДоставки(Ссылка)
	СтатусДоставкиУведомления = Неопределено;
	ДатаОтправкиУведомления = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД КАК Документ,
	|	МАКСИМУМ(УведомленияОтправленныеЧерезЛичныйКабинет.Период) КАК ДатаОтправки
	|ПОМЕСТИТЬ ВТ_Дата
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|ГДЕ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД
	|;
	|
	|/////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дата.ДатаОтправки КАК ДатаОтправки,
	|	УведомленияОтправленныеЧерезЛичныйКабинет.СтатусДоставкиУведомления КАК СтатусДоставкиУведомления
	|ИЗ ВТ_Дата
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|		ПО УведомленияОтправленныеЧерезЛичныйКабинет.КД = ВТ_Дата.Документ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтатусДоставкиУведомления = Выборка.СтатусДоставкиУведомления;
		ДатаОтправкиУведомления = Выборка.ДатаОтправки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
